backend/app/models/appointment.rb

  def no_conflict
    if Appointment.where(doctor_id: doctor_id, date: date).exists?
---
SELECT 1 AS one FROM "appointments" WHERE "appointments"."doctor_id" = 1 AND "appointments"."date" = '2025-11-22 14:57:22.274052' LIMIT 1