backend/app/controllers/api/v1/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" IN (1, 2, 3)
SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (1, 2, 3)
---
  def index
    @appointments = Appointment.includes(:doctor, :patient).all

INSERT INTO "appointments" ("doctor_id", "patient_id", "date", "reason", "created_at", "updated_at") VALUES (9, 8, '2025-11-22 16:20:00', 'Routine checkup and consultation', '2025-11-21 16:21:21.951492', '2025-11-21 16:21:21.951492') RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save