backend/app/controllers/api/v1/departments_controller.rb

SELECT "departments".* FROM "departments"
---
  def index
    @departments = Department.all

INSERT INTO "departments" ("name", "description", "created_at", "updated_at") VALUES ('Emergency Medicine', '24/7 Emergency care services', '2025-11-21 15:51:40.692944', '2025-11-21 15:51:40.692944') RETURNING "id"
---
  def create
    @department = Department.new(department_params)

    if @department.save