backend/app/controllers/api/v1/doctors_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" IN (1, 2, 3, 4)
SELECT "doctors".* FROM "doctors"
---
  def index
    @doctors = Doctor.includes(:department).all

INSERT INTO "doctors" ("name", "department_id", "phone", "created_at", "updated_at") VALUES ('Dr. Jane Smith', 5, '555-1234', '2025-11-21 15:51:46.051101', '2025-11-21 15:51:46.051101') RETURNING "id"
---
  def create
    @doctor = Doctor.new(doctor_params)

    if @doctor.save