backend/app/controllers/api/v1/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def create
    @patient = Patient.new(patient_params)

    if @patient.save
---
INSERT INTO "patients" ("name", "age", "phone", "created_at", "updated_at") VALUES ('John Doe', 35, '555-5678', '2025-11-21 15:51:49.404884', '2025-11-21 15:51:49.404884') RETURNING "id"